[{"productId":"0.0796591591743594","productName":"Physical Geography For UPSC","productPrice":"20","productDescription":"PMF IAS GEOGRAPHY book is one of the best book out there to read and understand the subject from upsc point of view, this book covers only physical geography, language is simple and easy to understand, illustrations of natures phenomenon make it fun to read.\r\n","productImage":"https://rukminim1.flixcart.com/image/416/416/xif0q/regionalbooks/o/p/2/physical-geography-for-upsc-and-state-civil-services-examination-original-imaghzva52jee57n.jpeg?q=70"},{"productId":"0.08021543240555662","productName":" Club You To Death","productPrice":"80","productDescription":"ujbbjbjbjbj","productImage":" https://rukminim1.flixcart.com/image/416/416/kn7sdjk0/regionalbooks/b/v/c/club-you-to-death-original-imagfy6kh3qy4dn3.jpeg?q=70"},{"productId":"0.23770624310168698","productName":" Messed Up! But All For Love","productPrice":"80","productDescription":"Arvind Parashar is an author and painter hailing from Dehradun. He has been a corporate leader in various firms like GE, Dell and Genpact. He enjoys road trips and gives motivational lectures at various educational institutes.","productImage":" https://rukminim1.flixcart.com/image/416/416/ki96c280-0/book/m/k/i/messed-up-but-all-for-love-original-imafy3a9smgz8crv.jpeg?q=70"},{"productId":"0.8201957247592679","productName":" The Forest of Enchantments","productPrice":"75","productDescription":"The Ramayana, one of the world's greatest epics, is also a tragic love story. In this brilliant retelling, Chitra Banerjee Divakaruni places Sita at the centre of the novel: this is Sita's version. The Forest of Enchantments is also a very human story of some of the other women in the epic, often misunderstood and relegated to the margins: Kaikeyi, Surpanakha, Mandodari. A powerful comment on duty, betrayal, infidelity and honour, it is also about women's struggle to retain autonomy in a world that privileges men, as Chitra transforms an ancient story into a gripping, contemporary battle of wills. While the Ramayana resonates even today, she makes it more relevant than ever, in the underlying questions in the novel: How should women be treated by their loved ones? What are their rights in a relationship? When does a woman need to stand up and say, 'Enough!'\r\n","productImage":" https://rukminim1.flixcart.com/image/416/416/k19lvgw0/book/5/7/7/the-forest-of-enchantments-original-imafkvkpauzgs3ut.jpeg?q=70"},{"productId":"0.05856606278292653","productName":"Grimms Fairy Tales","productPrice":"50","productDescription":"Once upon a time... there were two brothers, Jacob and Wilhelm Grimm, who gave the world nsome of the best-loved fairy tales ever written. The Brothers Grimm rediscovered a host of fairy tales, telling of princes and princesses in their castles, witches in their towers and forests, of giants and dwarfs, of fabulous animals and dark deeds. This selection of their folk tales was made and translated by Lucy Crane, and includes firm favourites such as Rapunzel, The Goose Girl, Sleeping Beauty, Hansel and Gretel and Snow White.","productImage":"https://rukminim1.flixcart.com/image/416/416/kk8mcnk0/book/2/i/2/grimms-fairy-tales-original-imafznfmgshukahc.jpeg?q=70"},{"productId":"0.20042894934558442","productName":" Saira Zariwala Is Afraid ","productPrice":"40","productDescription":"'Akaash, where are you?' Saira is thrilled about getting her own phone. What she's not so thrilled about is that most of the messages that arrive on it are for somebody called Akaash. As the messages get stranger, Saira's irritation gives way to curiosity. Who is Akaash? How has he disappeared so entirely that even his friends and family don't know where he is? Is he connected with the horrors that the police have unearthed in a fancy Mumbai building? Saira and her friends decide to play detective. But the light-hearted adventure soon turns dark and sinister. Someone is watching their every move. Someone thinks Saira knows much more than she does. Someone has killed once and is willing to kill again. Curiosity killed the cat. Will it kill Saira?\r\n","productImage":" https://rukminim1.flixcart.com/image/416/416/kxjav0w0/book/u/0/n/saira-zariwala-is-afraid-original-imag9y7f9faeebue.jpeg?q=70"},{"productId":"0.530105156982317","productName":"1984","productPrice":"100","productDescription":"lde knskndqknskc ksksdn ksnksfdnkseles","productImage":"https://rukminim1.flixcart.com/image/416/416/kqidx8w0/book/c/s/x/1984-original-imag4hzgdc6usdhz.jpeg?q=70"},{"productId":"0.2882178515551661","productName":"Sherlock Homes","productPrice":"70","productDescription":"The Complete Novels Of Sherlock Homes  (Paperback fully packed, Sir Arthur Conan Doyle)\r\nBe the first to Review this product\r\nSpecial price\r\n₹189₹25024% off\r\n\r\nHurry, Only 2 left!\r\nAvailable offers\r\n\r\nSpecial PriceGet extra 5% off (price inclusive of cashback/coupon)T&C\r\n\r\nBank Offer5% Cashback on Flipkart Axis Bank CardT&C\r\n\r\nPartner OfferSign up for Flipkart Pay Later and get Flipkart Gift Card worth upto ₹1000*Know More\r\n\r\nPartner OfferBuy this product and get upto ₹250 off on Flipkart FurnitureKnow More\r\nDelivery\r\n\r\nChang","productImage":"https://rukminim1.flixcart.com/image/416/416/ks6ef0w0/regionalbooks/j/p/i/the-complete-novels-of-sherlock-homes-original-imag5t5httzk6szs.jpeg?q=70"},{"productId":"0.9514564470666553","productName":" Percy Jackson ","productPrice":"110","productDescription":"Percy Jackson thinks he is an ordinary boy. When he learns the identity of his real father, his world changes forever and every Greek myth comes alive to drag him into their reality. Percy Jackson and Lightning Thief is the first in a series of fantasy novels which begins Percy's foray into the world of the Gods.\r\nSummary of the Book\r\nPercy Jackson is pretty ordinary for a 12 year old. Besides the ADHD and dyslexia, he's normal. Or almost as normal as a son of Poseidon can be anyway. Expelled from almost every school he has ever been to, he has no reason to think Yancy Academy is any different. A school trip changes everything as his teacher, Mrs. Dodds, turns into one of the three Furies straight out of Greek legends and attacks him. After being saved by his Latin teacher, everyone forgets Mrs. Dodds, Percy learns that his closest friend is a Satyr and that he is the son of Poseidon, the Greek God. With barely any time to come to terms about his demigod status, Percy faces dangers and wonders from the old books, not being able to believe what he is experiencing. He has no time though, blamed for stealing Zeus's lightning bolt, he needs to clear his name before Zeus manages to find him. And to do that he needs to find the Lightning Thief.\r\nAbout Rick Riordan\r\nRick Riordan is an American writer. He has also written Tres Navarre and The Kane Chronicles. Riordan graduated from the University of Texas.\r\nThe current title was adapted into a 2010 hit movie entitled: Percy Jackson & the Olympians: The Lightning Thief.\r\nSeries Reading Order\r\nThe next books in the series in reading order are: The Sea of Monsters, The Titan's Curse, The Battle of the Labyrinth, and The Last Olympian.\r\n","productImage":" https://rukminim1.flixcart.com/image/416/416/kufuikw0/book/z/f/8/percy-jackson-and-the-lightning-thief-book-1-original-imag7jnekngxpud6.jpeg?q=70"},{"productId":"0.6113291840550128","productName":"Life's Amazing Secrets","productPrice":"40","productDescription":"","productImage":"https://rukminim1.flixcart.com/image/416/416/ki7qw7k0-0/book/8/g/1/life-s-amazing-secrets-original-imafyfb8sjah7zbh.jpeg?q=70"},{"productId":"0.8752773564968588","productName":"Zen: The Art of Simple Living  ","productPrice":"30","productDescription":"Be more Zen in 2022 with this little book of 100 tips and activities to soothe the soul 'Brings the spirit of Zen Buddhism to everyday life . . . 100 snack-size Zen activities you can do daily to add more calm to your life' Daily Telegraph _______ Zen is the perfect antidote to the stress and uncertainty of modern life . . . In clear, practical and easy to follow lessons - one a day for 100 days - renowned Buddhist monk Shunmyo Masuno draws on centuries of wisdom to show you how to apply the essence of Zen to modern life. You will learn how to exhale deeply to eliminate negative emotions, to arrange your house simply to clear your thinking, to line up your shoes at night to bring order to your mind, to plant a single flower and watch it grow, to worry less about what you cannot control, and so much more . . . You will even make time to think about nothing at all. Simplify your life with the art of Zen, and learn how to feel more relaxed, fulfilled, and with a renewed sense of peace. _______ 'Full of the simplest yet richest rituals to adopt in order to live a long and happy life, this book of wisdom is a soothing balm of peace for anyone living in the busy modern world' Psychologies 'Does for mental clutter what Marie Kondo has done for household clutter' Publisher's Weekly 'This little treasure needs to be at every bedside' llan Lokos, author of Through the Flames, Patience, and Pocket Peace 'Zen: The Art of Simple Living makes the wisdom of the Buddha radically accessible' Dzogchen Ponlop Rinpoche, author of Emotional Rescue and Rebel Buddha","productImage":"https://rukminim1.flixcart.com/image/416/416/kufuikw0/book/s/x/k/zen-the-art-of-simple-living-original-imag7jz3g3bmhg43.jpeg?q=70"},{"productId":"0.8033189008182728","productName":" Don't Go to Sleep","productPrice":"65","productDescription":"Matt hates his tiny bedroom, but his mom refuses to let him sleep in the guest room. One night, Matt sneaks in there and his whole life changes. Every time he falls asleep, he wakes up in a new nightmare.\r\n","productImage":" https://rukminim1.flixcart.com/image/416/416/jpinjbk0/book/9/1/3/don-t-go-to-sleep-original-imafbqt6nkznzwqp.jpeg?q=70"}]